tap "heroku/brew"

# Shell
brew "zsh-completions"

# Core dev
brew "git"
brew "git-lfs"
brew "gh"
brew "gnupg"
brew "shellcheck"
brew "just"
brew "magic-wormhole"
brew "tmux"
brew "coreutils"

# Python
brew "pyenv"
brew "uv"

# Cloud & deployment
brew "awscli"
brew "heroku/brew/heroku"
brew "wrangler"
brew "netlify-cli"
cask "google-cloud-sdk"

# Fonts
cask "font-inter"
cask "font-montserrat"

# Apps
cask "1password"
cask "1password-cli"
cask "claude"
cask "docker"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "linear-linear"
cask "mongodb-compass"
cask "notion"
cask "rectangle"
cask "slack"
cask "spotify"
cask "zoom"
cask "zed"
